#+AUTHOR: ii team
#+TITLE: APIsnoop BOT
#+DATE: 15 August 2019
#+INCLUDE: "config.org"
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | TADA(d)
#+ARCHIVE: archive/meta_bot.archive.org::
#+PROPERTY: header-args:sql-mode+ :results silent


*** Dockerfile
#+NAME: apisnoop hasura dockerfile
#+BEGIN_SRC dockerfile :tangle ../apps/hasura/Dockerfile
  FROM hasura/graphql-engine:v1.0.0-beta.8.cli-migrations
  # FROM hasura/graphql-engine:v1.0.0-beta.8
  MAINTAINER Hippie Hacker <hh@ii.coop>
  COPY ./migrations /hasura-migrations
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
Sending build context to Docker daemon  58.88kB
Step 1/3 : FROM hasura/graphql-engine:v1.0.0-beta.8.cli-migrations
 ---> b24aef502cb9
Step 2/3 : MAINTAINER Hippie Hacker <hh@ii.coop>
 ---> Using cache
 ---> 82ecaff3a6e8
Step 3/3 : COPY ./migrations /hasura-migrations
 ---> 436ba05fbc37
Successfully built 436ba05fbc37
Successfully tagged raiinbow/hasura:2019-12-03-14-17
The push refers to repository [docker.io/raiinbow/hasura]
ec8d150bcf5f: Preparing
aa0837a119d4: Preparing
aa0837a119d4: Preparing
52b3e4e57c36: Preparing
3de0b48304b2: Preparing
aa0837a119d4: Layer already exists
3de0b48304b2: Layer already exists
52b3e4e57c36: Layer already exists
ec8d150bcf5f: Pushed
2019-12-03-14-17: digest: sha256:3b91b57fbcd4b8755b57d4580a608b2ad73e31e7d819352a7203278f30568d95 size: 1367
#+end_EXAMPLE


#+NAME: build hasura container image
#+begin_src shell :dir ../apps/hasura
  export TAG=$(TZ='Pacific/Auckland'; export TZ ; date +%F-%H-%M)
  docker build -t raiinbow/hasura:$TAG .
  docker push raiinbow/hasura:$TAG
#+end_src

#+RESULTS: build hasura container image
#+begin_src shell
Sending build context to Docker daemon  67.07kB
Step 1/3 : FROM hasura/graphql-engine:v1.0.0-beta.8.cli-migrations
 ---> b24aef502cb9
Step 2/3 : MAINTAINER Hippie Hacker <hh@ii.coop>
 ---> Using cache
 ---> 82ecaff3a6e8
Step 3/3 : COPY ./migrations /hasura-migrations
 ---> 06524b05f668
Successfully built 06524b05f668
Successfully tagged raiinbow/hasura:2020-01-08-15-51
The push refers to repository [docker.io/raiinbow/hasura]
740147e0ba28: Preparing
aa0837a119d4: Preparing
aa0837a119d4: Preparing
52b3e4e57c36: Preparing
3de0b48304b2: Preparing
52b3e4e57c36: Layer already exists
3de0b48304b2: Layer already exists
aa0837a119d4: Layer already exists
740147e0ba28: Pushed
2020-01-08-15-51: digest: sha256:fcc53f7226791c42e32d5e6b4419941c4b0348d74bded5e6f8217578beda4709 size: 1368
#+end_src

*** Dockerfile
#+BEGIN_SRC dockerfile :tangle ../apps/postgres/Dockerfile
  FROM postgres:12.0
  MAINTAINER Hippie Hacker <hh@ii.coop>
  RUN apt-get update \
    && apt-get install -y --no-install-recommends \
    postgresql-plpython3-12 \
    postgresql-12-plsh \
    python3-bs4\
    python3-requests \
    wget \
    make \
    gcc \
    libc6-dev \
    curl \
    jq \
    git \
    software-properties-common \
    apt-transport-https
  #  && rm -rf /var/lib/apt/lists/*

  RUN curl -L https://dl.google.com/go/go1.12.4.linux-amd64.tar.gz \
    | tar -C /usr/local -xzf - \
    && echo 'export PATH=$PATH:/usr/local/go/bin' \
    > /etc/profile.d/usr-local-go-path.sh \
    && echo 'export PATH=$PATH:$HOME/go/bin' \
    > /etc/profile.d/homedir-go-path.sh
  RUN . /etc/profile.d/usr-local-go-path.sh \
    && . /etc/profile.d/homedir-go-path.sh \
    && go get github.com/golangci/gofmt/gofmt \
    && go get -u golang.org/x/lint/golint \
    && go get golang.org/x/tools/cmd/goimports \
    && go get github.com/jgautheron/goconst/cmd/goconst \
    && go get github.com/jgautheron/usedexports \
    && go get -u github.com/kisielk/errcheck \
    && go get github.com/ii/apisnoopregexp \
    && cd ~/go/src/github.com/ii/apisnoopregexp \
    && make install \
    && cp ~/go/bin/rmatch /usr/local/bin
  COPY ./initdb /docker-entrypoint-initdb.d
  HEALTHCHECK --interval=10s --timeout=5s --start-period=5s --retries=5 \
    CMD ["pg_isready", "-U ", "apisnoop"] || exit 1
 # RUN sed -i -e"s/^#logging_collector = off.*$/logging_collector = on/" /var/lib/postgresql/data/postgresql.conf

#+END_SRC

#+begin_src shell :dir ../apps/postgres
  export TAG=$(TZ='Pacific/Auckland'; export TZ ; date +%F-%H-%M)
  docker build -t raiinbow/postgres:$TAG .
  docker push raiinbow/postgres:$TAG
#+end_src

#+RESULTS:
#+begin_EXAMPLE
Sending build context to Docker daemon  5.632kB
Step 1/7 : FROM postgres:12.0
 ---> f88dfa384cc4
Step 2/7 : MAINTAINER Hippie Hacker <hh@ii.coop>
 ---> Using cache
 ---> 94003ccb5b6a
Step 3/7 : RUN apt-get update    && apt-get install -y --no-install-recommends    postgresql-plpython3-12    postgresql-12-plsh    python3-bs4   python3-requests    wget    make    gcc    libc6-dev    curl    jq    git    software-properties-common    apt-transport-https
 ---> Using cache
 ---> 68e3d36cdb61
Step 4/7 : RUN curl -L https://dl.google.com/go/go1.12.4.linux-amd64.tar.gz    | tar -C /usr/local -xzf -    && echo 'export PATH=$PATH:/usr/local/go/bin'    > /etc/profile.d/usr-local-go-path.sh    && echo 'export PATH=$PATH:$HOME/go/bin'    > /etc/profile.d/homedir-go-path.sh
 ---> Using cache
 ---> 3690d673eabd
Step 5/7 : RUN . /etc/profile.d/usr-local-go-path.sh    && . /etc/profile.d/homedir-go-path.sh    && go get github.com/golangci/gofmt/gofmt    && go get -u golang.org/x/lint/golint    && go get golang.org/x/tools/cmd/goimports    && go get github.com/jgautheron/goconst/cmd/goconst    && go get github.com/jgautheron/usedexports    && go get -u github.com/kisielk/errcheck    && go get github.com/ii/apisnoopregexp    && cd ~/go/src/github.com/ii/apisnoopregexp    && make install    && cp ~/go/bin/rmatch /usr/local/bin
 ---> Using cache
 ---> db8c609add28
Step 6/7 : COPY ./initdb /docker-entrypoint-initdb.d
 ---> Using cache
 ---> e8ad5bc8a65c
Step 7/7 : HEALTHCHECK --interval=10s --timeout=5s --start-period=5s --retries=5    CMD ["pg_isready", "-U ", "apisnoop"] || exit 1
 ---> Using cache
 ---> e712ce7cc2a6
Successfully built e712ce7cc2a6
Successfully tagged raiinbow/postgres:2019-12-03-14-19
The push refers to repository [docker.io/raiinbow/postgres]
57cc3977e29d: Preparing
a5f4141a90fb: Preparing
71410a046adb: Preparing
4deeca980f47: Preparing
eb866fc784ea: Preparing
db69dddb7910: Preparing
9b3cf71cdd1a: Preparing
038d25594180: Preparing
8f1685521006: Preparing
a6a5c9284280: Preparing
662023ffbbc5: Preparing
9cf9bdafe72e: Preparing
22f5303efdd7: Preparing
64f23a63821f: Preparing
ddb50a567803: Preparing
809946863d5e: Preparing
3ba344018aaf: Preparing
b67d19e65ef6: Preparing
9cf9bdafe72e: Waiting
64f23a63821f: Waiting
22f5303efdd7: Waiting
ddb50a567803: Waiting
a6a5c9284280: Waiting
b67d19e65ef6: Waiting
809946863d5e: Waiting
3ba344018aaf: Waiting
db69dddb7910: Waiting
038d25594180: Waiting
662023ffbbc5: Waiting
8f1685521006: Waiting
eb866fc784ea: Layer already exists
db69dddb7910: Layer already exists
9b3cf71cdd1a: Layer already exists
038d25594180: Layer already exists
8f1685521006: Layer already exists
a6a5c9284280: Layer already exists
662023ffbbc5: Layer already exists
9cf9bdafe72e: Layer already exists
22f5303efdd7: Layer already exists
57cc3977e29d: Pushed
64f23a63821f: Layer already exists
ddb50a567803: Layer already exists
809946863d5e: Layer already exists
3ba344018aaf: Layer already exists
b67d19e65ef6: Layer already exists
a5f4141a90fb: Pushed
71410a046adb: Pushed
4deeca980f47: Pushed
2019-12-03-14-19: digest: sha256:45d56529b17e9814eb467d9f73d7c1f05dbcc857e5014e47383136960fe3d1ba size: 4090
#+end_EXAMPLE

*** Dockerfile
 #+NAME: dockerfile for auditlogger bot
 #+begin_src dockerfile :tangle ../apps/auditlogger/Dockerfile
 FROM node:12.13.0-stretch
 RUN wget --quiet -O - https://www.postgresql.org/media/keys/ACCC4CF8.asc | apt-key add -
 RUN  echo "deb http://apt.postgresql.org/pub/repos/apt/ stretch-pgdg main" > /etc/apt/sources.list.d/pgdg.list
 RUN apt update && \
     apt install -y vim postgresql-client-12 netcat
 WORKDIR /opt/apisnoop
 COPY auditlogger.js .
 COPY package.json .
 RUN npm i
 EXPOSE 9900
 CMD ["node", "auditlogger.js"]
 #+end_src

#+NAME: build auditlog bot container image
#+begin_src shell :dir ../apps/hasura
  export TAG=$(TZ='Pacific/Auckland'; export TZ ; date +%F-%H-%M)
  docker build -t raiinbow/auditlogger:$TAG .
  docker push raiinbow/auditlogger:$TAG
#+end_src

#+RESULTS: build auditlog bot container image
#+begin_EXAMPLE
Sending build context to Docker daemon   68.1kB
Step 1/3 : FROM hasura/graphql-engine:v1.0.0-beta.8.cli-migrations
 ---> b24aef502cb9
Step 2/3 : MAINTAINER Hippie Hacker <hh@ii.coop>
 ---> Using cache
 ---> 82ecaff3a6e8
Step 3/3 : COPY ./migrations /hasura-migrations
 ---> Using cache
 ---> bb2e8f81a468
Successfully built bb2e8f81a468
Successfully tagged raiinbow/auditlogger:2019-12-08-20-49
The push refers to repository [docker.io/raiinbow/auditlogger]
4de5b6dfe50f: Preparing
aa0837a119d4: Preparing
aa0837a119d4: Preparing
52b3e4e57c36: Preparing
3de0b48304b2: Preparing
3de0b48304b2: Layer already exists
4de5b6dfe50f: Layer already exists
52b3e4e57c36: Layer already exists
aa0837a119d4: Layer already exists
2019-12-08-20-49: digest: sha256:66833e0081ce1549fbdcedd5c38cf1c769086fde6088336df8db83a778bec37b size: 1368
#+end_EXAMPLE

** raiinbow.yaml
   
   #+begin_src yaml :tangle ../deployment/k8s/raiinbow.yaml
     apiVersion: v1
     kind: List
     metadata: {}
     items:
     - apiVersion: v1
       kind: Service
       metadata:
         name: hasura
       spec:
         type: ClusterIP
         clusterIP: None
         selector:
           io.apisnoop.graphql: hasura
         ports:
         - name: "8080"
           port: 8080
           targetPort: 8080
     - apiVersion: v1
       kind: Service
       metadata:
         name: postgres
       spec:
         selector:
           io.apisnoop.db: postgres
         ports:
         - name: "5432"
           port: 5432
           targetPort: 5432
     - apiVersion: extensions/v1beta1
       kind: Deployment
       metadata:
         name: hasura
       spec:
         replicas: 1
         template:
           metadata:
             labels:
               io.apisnoop.graphql: hasura
           spec:
             restartPolicy: Always
             containers:
             - name: hasura
               image: "raiinbow/hasura:2019-11-14-09-33"
               ports:
               - containerPort: 8080
               env:
               - name: HASURA_GRAPHQL_DATABASE_URL
                 value: "postgres://apisnoop:s3cretsauc3@postgres:5432/apisnoop"
               - name: HASURA_GRAPHQL_ENABLE_CONSOLE
                 value: "true"
     - apiVersion: extensions/v1beta1
       kind: Deployment
       metadata:
         name: postgres
       spec:
         replicas: 1
         template:
           metadata:
             labels:
               io.apisnoop.db: postgres
           spec:
             restartPolicy: Always
             containers:
             - name: postgres
               image: "raiinbow/postgres:2019-11-10-14-36"
               ports:
               - containerPort: 5432
               livenessProbe:
                 exec:
                   command:
                   - "pg_isready"
                   - "-U"
                   - "apisnoop"
                 failureThreshold: 5
                 periodSeconds: 10
                 timeoutSeconds: 5
               env:
               - name: POSTGRES_DB
                 value: apisnoop
               - name: POSTGRES_USER
                 value: apisnoop
               - name: POSTGRES_PASSWORD
                 value: s3cretsauc3
               - name: PGDATABASE
                 value: apisnoop
               - name: PGUSER
                 value: apisnoop
     - apiVersion: apps/v1
       kind: Deployment
       metadata:
         name: apisnoop-auditlogger
         namespace: kube-system
       spec:
         replicas: 1
         selector:
           matchLabels:
             app: apisnoop-auditlogger
         template:
           metadata:
             labels:
               app: apisnoop-auditlogger
           spec:
             containers:
               - name: apisnoop-auditlogger
                 image: "raiinbow/auditlogger:latest"
                 #command:
                 #  - "sleep"
                 #args: 
                 #  - "+Inf"
                 ports:
                   - containerPort: 9900
     - apiVersion: v1
       kind: Service
       metadata:
         name: apisnoop-auditlogger
         namespace: kube-system
       spec:
         ports:
           - port: 9900
             targetPort: 9900
         selector:
           app: apisnoop-auditlogger
         clusterIP: 10.96.96.96
         type: ClusterIP
     - apiVersion: auditregistration.k8s.io/v1alpha1
       kind: AuditSink
       metadata:
         name: auditlogger
         namespace: kube-system
       spec:
         policy:
           level: Metadata
           stages:
           - ResponseComplete
         webhook:
           throttle:
             qps: 10
             burst: 15
           clientConfig:
             #url: "http://apisnoop-auditlogger.kube-system.svc.cluster.local:9900/events"
             # svc cluster ip of apisnoop-auditlogger
             url: "http://10.96.96.96:9900/events"
   #+end_src
   
   To build up our rainbow.yaml again, we can run:
   #+NAME: update and push rainbow images based on docker-compose.yml
   #+begin_src shell :dir ../apps :tangle no
     . .loadenv
     kompose convert --build local --volumes emptyDir -o /dev/null 2>&1 | grep Pushing
     :
   #+end_src

   #+RESULTS: update and push rainbow images based on docker-compose.yml
   #+begin_EXAMPLE
   #+end_EXAMPLE

   #+RESULTS: update and push rainbow images based on docker-ujjcompose.yml
   #+begin_EXAMPLE
   [36mINFO[0m Pushing image 'raiinbow/hasura:2019-11-10-14-36' to registry 'docker.io' 
   [36mINFO[0m Pushing image 'raiinbow/postgres:2019-11-10-14-36' to registry 'docker.io' 
   #+end_EXAMPLE

